package com.meloda.lineqrreader.common

object AppConstants {

    const val PHONE_NUMBER_PATTERN =
        "^(\\+7|7|8)?[\\s\\-]?\\(?[489][0-9]{2}\\)?[\\s\\-]?[0-9]{3}[\\s\\-]?[0-9]{2}[\\s\\-]?[0-9]{2}\$"

    const val TIMER_TEXT_PATTERN = "%s %s : %s %s"

    const val titles =
        "Дверь межкомнатная,Стул деревянный кухонный,Микроволновая печь,Холодильник белый,Чайник красный,Сменный фильтр,Стиральная машина,Хлеб кирпич,Майонез,Молоко 1 л.,Масло сливочное 250 гр,Футболка белая,Шорты синие,Трико зелёное,Кроссовки белые,Рюкзак розовый"

    const val alphabet = "а,б,в,г,д,е,ж,з,и,к,л,м,н,о,п,р,с,т,у,ф,х,ц,ч,ш,щ,ы,э,ю,я"

}